// *++
//
// Copyright (c) 2005 - 2006, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution. The full text of the license may be found at         
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   LoadStrings.uni
// 
// Abstract:
// 
//   String definitions for the Shell load command
// 
// Revision History:
//  
// --*/

/=#

#langdef   eng "English"

#string STR_UNLOAD_MANAGING       #language eng  "     Managing       :\n"

#string STR_UNLOAD_CTRL_HS        #language eng  "       Ctrl[%h02x] : %hs\n"

#string STR_UNLOAD_CHILD_HS       #language eng  "         Child[%h02x] : %hs\n"

#string STR_UNLOAD_DRV_IMAGE      #language eng  "       Drv[%h02x] : Image(%hs)\n"

#string STR_UNLOAD_DRV_HS         #language eng  "       Drv[%h02x] : %hs\n"

#string STR_UNLOAD_MANAGED_BY_NONE    #language eng  "     Managed by         : %H<NONE>%N\n"

#string STR_UNLOAD_PARENT_CONTROLLERS #language eng  "     Parent Controllers :\n"

#string STR_UNLOAD_PARENT             #language eng  "       Parent[%h02x] : %hs\n"

#string STR_UNLOAD_PARENT_CONT_NONE   #language eng  "     Parent Controllers : %H<NONE>%N\n"

#string STR_UNLOAD_CHILD_CONTROL      #language eng  "     Child Controllers  :\n"

#string STR_UNLOAD_CHILD              #language eng  "       Child[%h02x] : %hs\n"

#string STR_UNLOAD_CHILD_CONTROL_NONE #language eng  "     Child Controllers  : %H<NONE>%N\n"

#string STR_UNLOAD_DRIVER_NAME        #language eng  "     Driver Name    : %hs\n"

#string STR_UNLOAD_DRIVER_NAME_NONE   #language eng  "     Driver Name    : %H<NONE>%N\n"
                                    
#string STR_UNLOAD_IAMGE_NAME         #language eng  "     Image Name     : %hs\n"
                                      
#string STR_UNLOAD_IMAGE_NAME_NONE    #language eng  "     Image Name     : %H<NONE>%N\n"
                                       
#string STR_UNLOAD_DRIVER_VERSION     #language eng  "     Driver Version : %h08x\n"
                                       
#string STR_UNLOAD_DRIVER_TYPE_HBUS   #language eng  "     Driver Type    : %HBUS%N\n"
                                      
#string STR_UNLOAD_DRIVER_TYPE_HDEVICE  #language eng  "     Driver Type    : %HDEVICE%N\n"
                                       
#string STR_UNLOAD_DRIVER_TYPE_UNKNOWN  #language eng  "     Driver Type    : %H<UNKNOWN>%N\n"
                                     
#string STR_UNLOAD_CONFIG_HYES_2		#language eng  "     Configuration  : %HYES%N\n"
                                    
#string STR_UNLOAD_CONFIG_HNO_2			#language eng  "     Configuration  : %HNO%N\n"
                                      
#string STR_UNLOAD_DIAGNOSTICS_HYES		#language eng  "     Diagnostics    : %HYES%N\n"
                                   
#string STR_UNLOAD_DIAGNOSTICS_HNO		#language eng  "     Diagnostics    : %HNO%N\n"
                                     
#string STR_UNLOAD_MANAGING_NONE		#language eng  "     Managing       : %H<NONE>%N\n"
                                     
#string STR_UNLOAD_MANAGED_BY			#language eng  "     Managed by :\n"
                                     
#string STR_UNLOAD_CONFIG_HYES			#language eng  "     Configuration      : %HYES%N\n"
                                     
#string STR_UNLOAD_CONFIG_HNO			#language eng  "     Configuration      : %HNO%N\n"
                                      
#string STR_UNLOAD_DIAG_HYES			#language eng  "     Diagnostics        : %HYES%N\n"
                                   
#string STR_UNLOAD_DIAG_HNO				#language eng  "     Diagnostics        : %HNO%N\n"
                                      
#string STR_UNLOAD_ROOT					#language eng  "%HROOT%N\n"
                                  
#string STR_UNLOAD_HBUS					#language eng  "%HBUS%N\n"
                                      
#string STR_UNLOAD_HDEVICE				#language eng  "%HDEVICE%N\n"
                                     
#string STR_UNLOAD_CONTROLLER_TYPE		#language eng  "     Controller Type    : "
                                       
#string STR_UNLOAD_DEV_PATH_2			#language eng  "     Device Path        : %H<NONE>%N\n"

#string STR_UNLOAD_DEV_PAATH			#language eng  "     Device Path        : %hs\n"

#string STR_UNLOAD_UNKNOWN_2			#language eng  "<UNKNOWN>\n"

#string STR_UNLOAD_CONTROLLER_NAME		#language eng  "     Controller Name    : "

#string STR_UNLOAD_TWO_VARS_HG_NEW		#language eng  "   %hg (%08x)\n"

#string STR_UNLOAD_ONE_VAR_HS			#language eng  "%hs "

#string STR_UNLOAD_TWO_VARS_HS			#language eng  "   %hs (%hx) "

#string STR_UNLOAD_TWO_VARS_N			#language eng  "%N %h2x: "

#string STR_UNLOAD_NHANDLE				#language eng  "%NHandle %h02x (%hX)\n"

#string STR_UNLOAD_LOCATE_LOADIMAGEPROT #language eng  "%Hunload%N: Locate LoadedImageProtocol error - %r\n"

#string STR_UNLOAD_HANDLE_INDEX			#language eng  "%Hunload%N: Handle index does not specify a driver image\n"

#string STR_UNLOAD_PROTOCOL_IMAGE_ERROR #language eng  "%Hunload%N: Unload driver image error - %r\n"

#string STR_UNLOAD_LINE_HELP		       #language eng  "Unloads a EFI driver"

#string STR_UNLOAD_VERBOSE_HELP        #language eng  "Unloads a EFI driver.\n"
                                                      "\n"
                                                      "UNLOAD [-n] [-v] Handle\n"
                                                      "\n"
                                                      "    -n       - Unload driver without prompting\n"
                                                      "    -v       - Display verbose information\n"
                                                      "    Handle   - Handle of driver to unload in hexadecimal format\n"
                                                      "\n"
                                                      "Note:\n"
                                                      "    1. The '-n' option can be used to skip all prompts during unloading.\n"
                                                      "    2. If the '-v' option is specified, verbose image information will be\n"
                                                      "       displayed before the image is unloaded.\n"
                                                      "    3. Only drivers that support unloading can be successfully unloaded.\n"
                                                      "    4. Use the 'LOAD' command to load a driver.\n"
                                                      "\n"
                                                      "Examples:\n"
                                                      "  * To find the handle for the EFI driver image to unload:\n"
                                                      "    Shell> dh -b\n"
                                                      "    Handle dump\n"
                                                      "      1: Image(DXE Core)\n"
                                                      "      2: FwVol FwFileSys FwVolBlk DevPath(MemMap(11:1760000-189FFC8))\n"
                                                      "         ...\n"
                                                      "     27: Image(Reset)\n"
                                                      "     28: Image(WinNtBlockIo) DriverBinding\n"
                                                      "     29: Image(Timer)\n"
                                                      "        ...\n"
                                                      "\n"
                                                      "  * To unload the 'Reset' EFI driver image:\n"
                                                      "    Shell> unload 27\n"
                                                      "     27: Image(Reset)\n"
                                                      "    Unload driver image (y/n)? n\n"
                                                      "    Exit status code: Aborted\n"
